# TP2 : Network low-level, Switching

# I. Simplest setup

#### Topologie

```
+-----+        +-------+        +-----+
| PC1 +--------+  SW1  +--------+ PC2 |
+-----+        +-------+        +-----+
```

#### Plan d'adressage

Machine | `net1`
--- | ---
`PC1` | `10.2.1.1/24`
`PC2` | `10.2.1.2/24`

#### ToDo

> **Si vous lancez Wireshark, et que vous mettez des dumps/captures d'√©cran, pr√©cisez o√π vous avez lanc√© Wireshark (sur quel lien r√©seau/quelle machine et quelle interface)**

* üåû mettre en place la topologie ci-dessus

![CaptureTopo1](CaptureTopo1.png)

* üåû faire communiquer les deux PCs
  * avec un `ping` qui fonctionne
```bash
PC1> ping 10.2.1.2/24
84 bytes from 10.2.1.2 icmp_seq=1 ttl=64 time=0.224 ms
84 bytes from 10.2.1.2 icmp_seq=2 ttl=64 time=0.304 ms
84 bytes from 10.2.1.2 icmp_seq=3 ttl=64 time=0.358 ms
84 bytes from 10.2.1.2 icmp_seq=4 ttl=64 time=0.296 ms
84 bytes from 10.2.1.2 icmp_seq=5 ttl=64 time=0.358 ms

PC2> ping 10.2.1.1/24
84 bytes from 10.2.1.1 icmp_seq=1 ttl=64 time=0.408 ms
84 bytes from 10.2.1.1 icmp_seq=2 ttl=64 time=0.311 ms
84 bytes from 10.2.1.1 icmp_seq=3 ttl=64 time=0.336 ms
84 bytes from 10.2.1.1 icmp_seq=4 ttl=64 time=0.392 ms
84 bytes from 10.2.1.1 icmp_seq=5 ttl=64 time=0.298 ms
```

* d√©terminer le protocole utilis√© par `ping` √† l'aide de Wireshark

Le protocole est ICMP 

![CaptureICMP1](CaptureICMP1.png)
  * analyser les √©changes ARP
    * utiliser Wireshark et mettre en √©vidence l'√©change ARP entre les deux machines (`ARP Request` et `ARP Reply`)

    ![CaptureARP1](CaptureARP1.png)
    ![CaptureARP2](CaptureARP2.png)
    * corr√©ler avec les tables ARP des diff√©rentes machines
```bash
PC1> show arp
00:50:79:66:68:00  10.2.1.2 expires in 114 seconds

PC2> show arp
00:50:79:66:68:01  10.2.1.1 expires in 111 seconds
```
* üåû r√©capituler toutes les √©tapes (dans le compte-rendu, √† l'√©crit) quand `PC1` ex√©cute `ping PC2` pour la premi√®re fois
  * √©changes ARP
  ```bash
  PC1 envoi une request en protocol ARP puis PC2 envoi une reply en protocol ARP.
  ```
  * √©change `ping`
  ```bash
  PC1 envoi une request en protocol ICMP de type 8 et PC2 envoi une reply en protocol ICMP de type 0.
  ```
* üåû expliquer...
  * pourquoi le switch n'a pas besoin d'IP
  ```bash
  Le switch ne fait que rediriger les informations donc il n a pas besoin d IP.
  ```
  * pourquoi les machines ont besoin d'une IP pour pouvoir se `ping`
  ```bash
  Pour conna√Ætre le destinataire.
  ```

# II. More switches

#### Topologie

```
                        +-----+
                        | PC2 |
                        +--+--+
                           |
                           |
                       +---+---+
                   +---+  SW2  +----+
                   |   +-------+    |
                   |                |
                   |                |
+-----+        +---+---+        +---+---+        +-----+
| PC1 +--------+  SW1  +--------+  SW3  +--------+ PC3 |
+-----+        +-------+        +-------+        +-----+
```

#### Plan d'adressage

Machine | `net1`
--- | ---
`PC1` | `10.2.2.1/24`
`PC2` | `10.2.2.2/24`
`PC3` | `10.2.2.3/24`

#### ToDo

* üåû mettre en place la topologie ci-dessus

![CaptureTopo2](CaptureTopo2.png)
* üåû faire communiquer les trois PCs
  * avec des `ping` qui fonctionnent
```bash
PC1> ping 10.2.2.2/24
84 bytes from 10.2.2.2 icmp_seq=1 ttl=64 time=0.442 ms
84 bytes from 10.2.2.2 icmp_seq=2 ttl=64 time=0.549 ms
84 bytes from 10.2.2.2 icmp_seq=3 ttl=64 time=0.900 ms
84 bytes from 10.2.2.2 icmp_seq=4 ttl=64 time=0.449 ms
84 bytes from 10.2.2.2 icmp_seq=5 ttl=64 time=0.446 ms

PC1> ping 10.2.2.3/24
84 bytes from 10.2.2.3 icmp_seq=1 ttl=64 time=0.310 ms
84 bytes from 10.2.2.3 icmp_seq=2 ttl=64 time=0.502 ms
84 bytes from 10.2.2.3 icmp_seq=3 ttl=64 time=0.515 ms
84 bytes from 10.2.2.3 icmp_seq=4 ttl=64 time=0.470 ms
84 bytes from 10.2.2.3 icmp_seq=5 ttl=64 time=0.518 ms
```
```bash
PC2> ping 10.2.2.1/24
84 bytes from 10.2.2.1 icmp_seq=1 ttl=64 time=0.645 ms
84 bytes from 10.2.2.1 icmp_seq=2 ttl=64 time=0.524 ms
84 bytes from 10.2.2.1 icmp_seq=3 ttl=64 time=0.451 ms
84 bytes from 10.2.2.1 icmp_seq=4 ttl=64 time=0.561 ms
84 bytes from 10.2.2.1 icmp_seq=5 ttl=64 time=0.577 ms

PC2> ping 10.2.2.3/24
84 bytes from 10.2.2.3 icmp_seq=1 ttl=64 time=1.266 ms
84 bytes from 10.2.2.3 icmp_seq=2 ttl=64 time=0.851 ms
84 bytes from 10.2.2.3 icmp_seq=3 ttl=64 time=0.581 ms
84 bytes from 10.2.2.3 icmp_seq=4 ttl=64 time=0.637 ms
84 bytes from 10.2.2.3 icmp_seq=5 ttl=64 time=0.823 ms
```
```bash
PC3> ping 10.2.2.1/24
84 bytes from 10.2.2.1 icmp_seq=1 ttl=64 time=0.584 ms
84 bytes from 10.2.2.1 icmp_seq=2 ttl=64 time=0.706 ms
84 bytes from 10.2.2.1 icmp_seq=3 ttl=64 time=0.531 ms
84 bytes from 10.2.2.1 icmp_seq=4 ttl=64 time=0.818 ms
84 bytes from 10.2.2.1 icmp_seq=5 ttl=64 time=0.473 ms

PC3> ping 10.2.2.2/24
84 bytes from 10.2.2.2 icmp_seq=1 ttl=64 time=0.609 ms
84 bytes from 10.2.2.2 icmp_seq=2 ttl=64 time=0.620 ms
84 bytes from 10.2.2.2 icmp_seq=3 ttl=64 time=1.476 ms
84 bytes from 10.2.2.2 icmp_seq=4 ttl=64 time=0.862 ms
84 bytes from 10.2.2.2 icmp_seq=5 ttl=64 time=0.930 ms
```
* üåû analyser la table MAC d'un switch
  * `show mac address-table`
```bash
IOU5#show mac address-table
          Mac Address Table
-------------------------------------------
Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    aabb.cc00.0210    DYNAMIC     Et0/1
   1    aabb.cc00.0320    DYNAMIC     Et0/1
   1    aabb.cc00.0330    DYNAMIC     Et0/3
Total Mac Addresses for this criterion: 3

```
  * comprendre/expliquer chaque ligne
```bash
En faisant show mac adress-table, on voit les machines qui sont connect√©es √† ce switch quand elles se sont ping.
```
* üêô en lan√ßant Wireshark sur les liens des switches, il y a des trames CDP qui circulent. Quoi qu'est-ce ?
```bash
C est un protocole qui permet de trouver d autres p√©riph√©riques voisins directement connect√©s.
```
#### Mise en √©vidence du Spanning Tree Protocol

STP a √©t√© ici automatiquement configur√© par les switches eux-m√™mes pour √©viter une boucle r√©seau. 

Dans une configuration pareille, les switches ont √©lu un chemin de pr√©f√©rence.  
Si on consid√®re les trois liens qui unissent les switches :
* `SW1` <> `SW2`
* `SW2` <> `SW3`
* `SW1` <> `SW3`  

**L'un de ces liens a forc√©ment √©t√© d√©sactiv√©.**

On va regarder comment STP a √©t√© configur√©.

* üåû d√©terminer les informations STP
  * √† l'aide des [commandes d√©di√©es au protocole](/memo/cli-cisco.md #stp)
```bash  
IOU5#show spanning-tree

VLAN0001
  Spanning tree enabled protocol rstp
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0100
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    Shr
Et0/1               Desg FWD 100       128.2    Shr
Et0/2               Desg FWD 100       128.3    Shr
Et0/3               Desg FWD 100       128.4    Shr
Et1/0               Desg FWD 100       128.5    Shr
Et1/1               Desg FWD 100       128.6    Shr
Et1/2               Desg FWD 100       128.7    Shr
Et1/3               Desg FWD 100       128.8    Shr
 --More--
```
```bash
IOU5#show spanning-tree bridge

                                                   Hello  Max  Fwd
Vlan                         Bridge ID              Time  Age  Dly  Protocol
---------------- --------------------------------- -----  ---  ---  --------
VLAN0001         32769 (32768,   1) aabb.cc00.0100    2    20   15  rstp
```
```bash
IOU5#show spanning-tree summary
Switch is in rapid-pvst mode
Root bridge for: VLAN0001
Extended system ID                      is enabled
Portfast Default                        is disabled
Portfast Edge BPDU Guard Default        is disabled
Portfast Edge BPDU Filter Default       is disabled
Loopguard Default                       is disabled
PVST Simulation Default                 is enabled but inactive in rapid-pvst mode
Bridge Assurance                        is enabled
EtherChannel misconfig guard            is enabled
Configured Pathcost method used is short
UplinkFast                              is disabled
BackboneFast                            is disabled

Name                   Blocking Listening Learning Forwarding STP Active
---------------------- -------- --------- -------- ---------- ----------
VLAN0001                     0         0        0         16         16
---------------------- -------- --------- -------- ---------- ----------
1 vlan                       0         0        0         16         16
```

* üåû faire un sch√©ma en repr√©sentant les informations STP
  * r√¥le des switches (qui est le root bridge)
  * r√¥le de chacun des ports

![CaptureRole](CaptureRole.png)

* üåû confirmer les informations STP
  * effectuer un `ping` d'une machine √† une autre
  * v√©rifier que les trames passent bien par le chemin attendu (Wireshark)
* üåû ainsi, d√©terminer quel lien a √©t√© d√©sactiv√© par STP
 ```bash
  IOU1 vers IOU2 le protocole a d√©sactiv√© le lien.
```
  ![CaptureSTP1](CaptureSTP1.png)

  ![CaptureSTP2](CaptureSTP2.png)

  ![CaptureSTP3](CaptureSTP3.png)

* üåû faire un sch√©ma qui explique le trajet d'une requ√™te ARP lorsque PC1 ping PC3, et de sa r√©ponse
  * repr√©senter **TOUTES** les trames ARP (n'oubliez pas les broadcasts)
  
![CaptureTrameARP](CaptureTrameARP.png)
#### Reconfigurer STP

* üåû changer la priorit√© d'un switch qui n'est pas le *root bridge*
```bash
On donne la priorit√© au IOU1:

IOU1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU1(config)#spanning-tree vlan 1 priority 4096
IOU1(config)#^Z
IOU1#
*Oct 16 23:12:51.922: %SYS-5-CONFIG_I: Configured from console by console
```
* üåû v√©rifier les changements
  * avec des commandes sur les switches
```bash
IOU2#show spanning-tree

VLAN0001
  Spanning tree enabled protocol rstp
  Root ID    Priority    4097
             Address     aabb.cc00.0200
             Cost        100
             Port        3 (Ethernet0/2)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0300
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    Shr
Et0/1               Desg FWD 100       128.2    Shr
Et0/2               Root FWD 100       128.3    Shr
Et0/3               Altn BLK 100       128.4    Shr
Et1/0               Desg FWD 100       128.5    Shr
Et1/1               Desg FWD 100       128.6    Shr
Et1/2               Desg FWD 100       128.7    Shr
 --More--
```
  * üêô capturer les √©changes qui suivent une reconfiguration STP avec Wireshark

#### üêô STP & Perfs

Si vous avez lanc√© Wireshark sur un lien entre un PC et un Switch, vous avez vu qu'il y a toujours des trames STP qui circulent...
* un peu con non ? C'est un PC, il enverra jamais de trames STP
* aussi avec STP, quand on branche un PC, le lien mettra plusieurs secondes avant de passer en *forwarding* et ainsi transmettre de la donn√©e
* l'id√©al √ßa serait de d√©sactiver l'envoi de trames STP sur l'interface du switch (√ßa √©vite de cramer de la bande passante et du calcul CPU pour rien, g√©n√©rer du trafic inutile, etc.)
* sauuuuf que si un p'tit malin branche des switches l√†-dessus, il pourrait tout p√©ter en cr√©ant une boucle
* deux fonctionnalit√©s √† mettre en place : 
  * `portfast` : marque un port comme *"edge"* dans la topologie STP. Un port *edge* est consid√©r√© comme une extr√©mit√© de la topologie (= un client branch√© dessus, port *access*). *Port**fast*** parce que √ßa va permettre au port de s'allumer plus rapidement (sans passer par les √©tats *listening* et *learning* pendant 15 secondes chacun par d√©faut) et d'√™tre disponible instantan√©ment
    * on peut voir l'√©tat d'un port (forward, listening, learning, blocking avec `show spanning-tree vlan 1`)
  * `bpduguard` : permet de shutdown le port s'il re√ßoit des *BPDU* (pour rappel : un *BPDU* c'est un message STP)  
  
Idem pour les trames CDP !

üêô ToDo :
  * [activer ces fonctionnalit√©s (*portfast* et *bpduguard*) et activer le filtre BPDU](/memo/cli-cisco.md#stp) sur les interfaces o√π c'est n√©cessaire (marqu√© comme *edge* dans la topologie STP)
  * aussi [d√©sactiver l'envoi de trames CDP](/memo/cli-cisco.md#cdp) sur ces ports
    * prouver avec Wireshark que le switch n'envoie plus de BPDU ni de trames CDP
    * faites une capture avant et une capture apr√®s les manips pour le prouver :)

# III. Isolation

## 1. Simple
 
#### Topologie
```
+-----+        +-------+        +-----+
| PC1 +--------+  SW1  +--------+ PC3 |
+-----+      10+-------+20      +-----+
                 20|
                   |
                +--+--+
                | PC2 |
                +-----+
```

#### Plan d'adressage

Machine | IP `net1` | VLAN
--- | --- | --- 
`PC1` | `10.2.3.1/24` | 10
`PC2` | `10.2.3.2/24` | 20
`PC3` | `10.2.3.3/24` | 20

#### ToDo

* üåû mettre en place la topologie ci-dessus
  * voir [les commandes d√©di√©es √† la manipulation de VLANs](/memo/cli-cisco.md#vlan)
```bash 
IOU5#sh vlan
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/0, Et0/1, Et0/2, Et0/3
                                                Et1/0, Et1/1, Et1/2, Et1/3
                                                Et2/0, Et2/1, Et2/2, Et2/3
                                                Et3/0, Et3/1, Et3/2, Et3/3
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        0      0
1003 tr    101003     1500  -      -      -        -    -        0      0
1004 fdnet 101004     1500  -      -      -        ieee -        0      0
1005 trnet 101005     1500  -      -      -        ibm  -        0      0
```
```bash
IOU5#sh vlan br

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/0, Et0/1, Et0/2, Et0/3
                                                Et1/0, Et1/1, Et1/2, Et1/3
                                                Et2/0, Et2/1, Et2/2, Et2/3
                                                Et3/0, Et3/1, Et3/2, Et3/3
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup
```
* üåû faire communiquer les PCs deux √† deux
  * v√©rifier que `PC2` ne peut joindre que `PC3`
  ```bash
  PC-2> ping 10.2.3.1
  host (10.2.3.1) not reachable
  ```
  ```bash
  PC-2> ping 10.2.3.3
  84 bytes from 10.2.3.3 icmp_seq=1 ttl=64 time=1.780 ms
  84 bytes from 10.2.3.3 icmp_seq=2 ttl=64 time=2.403 ms
  ```
  * v√©rifier que `PC1` ne peut joindre personne alors qu'il est dans le m√™me r√©seau (sad)
  ```bash
  PC-1> ping 10.2.3.2
  host (10.2.3.2) not reachable
  ```
  ```bash
  PC-1> ping 10.2.3.3
  host (10.2.3.3) not reachable
  ```

## 2. Avec trunk

#### Topologie

```
+-----+        +-------+        +-------+        +-----+
| PC1 +--------+  SW1  +--------+  SW2  +--------+ PC4 |
+-----+      10+-------+        +-------+20      +-----+
                 20|              10|
                   |                |
                +--+--+          +--+--+
                | PC2 |          | PC3 |
                +-----+          +-----+
```

#### Plan d'adressage

Machine | IP `net1` | IP `net2` | VLAN
--- | --- | --- | ---
`PC1` | `10.2.10.1/24` | X | 10
`PC2` | X | `10.2.20.1/24` | 20
`PC3` | `10.2.10.2/24` | X | 10
`PC4` | X | `10.2.20.2/24` | 20

#### ToDo

* üåû mettre en place la topologie ci-dessus
```bash
PC1: VLAN 10 / 10.2.10.1/24
PC2: VLAN 20 / 10.2.20.1/24
PC3: VLAN 10 / 10.2.10.2/24
PC4: VLAN 20 / 10.2.20.2/24
```
* üåû faire communiquer les PCs deux √† deux
  * v√©rifier que `PC1` ne peut joindre que `PC3`
```bash
PC1> ping 10.2.10.2
84 bytes from 10.2.10.2 icmp_seq=1 ttl=64 time=0.867 ms
84 bytes from 10.2.10.2 icmp_seq=2 ttl=64 time=0.659 ms
84 bytes from 10.2.10.2 icmp_seq=3 ttl=64 time=0.717 ms
```
  * v√©rifier que `PC4` ne peut joindre que `PC2`
```bash
PC1> ping 10.2.20.2
host (10.2.20.2) Not reachable
```
```bash
PC1> ping 10.2.20.1
host (10.2.20.1) Not reachable
```
* üåû mettre en √©vidence l'utilisation des VLANs avec Wireshark

# IV. Need perfs

#### Topologie

Pareil qu'en [III.2.](#2-avec-trunk) √† part le lien entre SW1 et SW2 qui est doubl√©.

```
+-----+        +-------+--------+-------+        +-----+
| PC1 +--------+  SW1  |        |  SW2  +--------+ PC4 |
+-----+      10+-------+--------+-------+20      +-----+
                 20|              10|
                   |                |
                +--+--+          +--+--+
                | PC2 |          | PC3 |
                +-----+          +-----+

```
#### Plan d'adressage

Pareil qu'en [III.2.](#2-avec-trunk).

Machine | IP `net1` | IP `net2` | VLAN
--- | --- | --- | ---
`PC1` | `10.2.10.1/24` | X | 10
`PC2` | X | `10.2.20.1/24` | 20
`PC3` | `10.2.10.2/24` | X | 10
`PC4` | X | `10.2.20.2/24` | 20

#### ToDo

* üåû mettre en place la topologie ci-dessus
  * configurer LACP entre `SW1` et `SW2`
  * utiliser Wireshark pour mettre en √©vidence l'utilisation de trames LACP
  * **v√©rifier avec un `show ip interface po1` que la bande passante a bien √©t√© doubl√©e**

> Pas de failover possible sur les IOUs malheureusement :( (voir [ce doc](https://www.cisco.com/c/en/us/td/docs/switches/blades/3020/software/release/12-2_58_se/configuration/guide/3020_scg/swethchl.pdf), derni√®re section. Pas de link state dans les IOUs)